# # basic lib
# read_lib   /nfs/share/process_node/ihp13/pdk/ihp-sg13g2/libs.ref/sg13g2_stdcell/lib/sg13g2_stdcell_typ_1p20V_25C.lib
# read_lib   /nfs/share/process_node/ihp13/pdk/ihp-sg13g2/libs.ref/sg13g2_io/lib/sg13g2_io_typ_1p2V_3p3V_25C.lib
# ccs lib
# read_lib /nfs/share/foundry/s110/SCC011UMS_HD_LVT_V0.1a/SCC011UMS_HD_LVT_V0p1a/liberty/1.2v/scc011ums_hd_lvt_tt_v1p2_25c_ccs.lib
# read_lib /nfs/share/foundry/s110/SCC011UMS_HD_HVT_V0.1a/SCC011UMS_HD_HVT_V0p1a/liberty/1.2v/scc011ums_hd_hvt_tt_v1p2_25c_ccs.lib
# read_lib /nfs/share/foundry/s110/SCC011UMS_HD_RVT_V0.1a/SCC011UMS_HD_RVT_V0p1a/liberty/1.2v/scc011ums_hd_rvt_tt_v1p2_25c_ccs.lib

read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/tech/tsmcn28_9lm6X2ZUTRDL.tlef

read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140hvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140lvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140mb.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140mblvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140opp.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140opphvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140opplvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140oppuhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140oppulvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140uhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140hvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140lvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140mb.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140mblvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140opp.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140opphvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140opplvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140oppuhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140oppulvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140uhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140hvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140lvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140mb.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140mbhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140opp.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140opphvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140opplvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140oppuhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp40p140uhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140mbhvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp30p140ulvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tcbn28hpcplusbwp35p140ulvt.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta64x128m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta64x128m2fw_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta256x32m4fw_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta128x32m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta128x64m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta128x80m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta128x8m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta512x64m4f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta512x64m4fw_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta64x32m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta64x8m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta64x64m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta8x128m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts6n28hpcplvta16x128m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta8x144m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts6n28hpcplvta512x2m8f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta256x16m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta64x80m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta32x128m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta32x32m2f_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta1024x32m8fw_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta128x144m2fw_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/ts5n28hpcplvta256x144m2fw_130a.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tpbn28v.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tphn28hpcpgv18_9lm.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/PLLTS28HPMLAINT.lef
read_lef /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/lef/tpbn28v_9lm.lef

read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140uhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140opphvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140oppuhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140ulvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140opplvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140opphvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140oppssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140lvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140opplvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140opphvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140mbssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140opplvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140oppssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140ulvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140hvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140uhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140lvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140lvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140mbhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140mbssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140uhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140mblvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140oppuhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140hvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140oppuhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140oppulvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140hvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/PLLTS28HPMLAINT_SS_0P81_125C.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140oppulvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140mbssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp30p140mblvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp35p140oppssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tcbn28hpcplusbwp40p140mbhvtssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/ccslib/tphn28hpcpgv18ssg0p81v1p62v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta32x128m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta8x128m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta64x32m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta512x64m4fw_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts6n28hpcplvta512x2m8f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts6n28hpcplvta16x128m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta256x144m2fw_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta64x128m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta64x80m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta8x144m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta64x64m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta64x8m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta512x64m4f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta64x128m2fw_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta1024x32m8fw_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta128x8m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta128x80m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta128x64m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta128x144m2fw_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta256x32m4fw_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta128x32m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta256x16m2f_130a_ssg0p81v125c.lib
read_lib /nfs/share/home/zhuangchunan/proj/Flow_T28/lib_data/mem/ts5n28hpcplvta32x32m2f_130a_ssg0p81v125c.lib


# read_def /nfs/share/home/huangzhipeng/retrosoc_asic_flatten_0309/workspace/output/iEDA/result/retrosoc_asic_CTS.def
read_def /nfs/share/home/zhaoxueyan/dataset_baseline/aes/workspace/output/Sizer/result/aes_optTiming.def.gz
read_sdc /nfs/share/home/zhaoxueyan/dataset_baseline/aes/syn_netlist/aes.sdc

# read_verilog /nfs/share/home/zhaoxueyan/flow_110_commercial/retrosoc_asic.final.v
# read_sdc /home/zhaoxueyan/code/gpu_gate_sizing/smic110/retrosoc_asic_SYN_TYP.sdc
# read_def /nfs/share/tapout/smic110/retrosoc_asic_flatten/workspace/output/iEDA/result/retrosoc_asic_place_new.def
# read_sdc /nfs/share/tapout/smic110/retrosoc_asic_flatten/syn_netlist/retrosoc_asic.sdc
# -hold
# read_spef /nfs/share/home/zhaoxueyan/flow_110_commercial/ret.spef

# Capture utilization before fillers make it 100%
utl::metric "DPL::utilization" [format %.1f [expr [rsz::utilization] * 100]]
utl::metric "DPL::design_area" [sta::format_area [rsz::design_area] 0]

set design "aes"
set platform "tsmc28"
set min_routing_layer "M2"
set max_routing_layer "M7"
################################################################
# timing opt

set_wire_rc -signal -layer M2
set_wire_rc -clock  -layer M5

global_route -congestion_iterations 100
estimate_parasitics -global_routing

repair_clock_nets

report_worst_slack -min -digits 3
report_worst_slack -max -digits 3
report_tns -digits 3
report_check_types -max_slew -max_capacitance -max_fanout -violators -digits 3

repair_timing -verbose

# set_thread_count 64
# pin_access -bottom_routing_layer $min_routing_layer \
#            -top_routing_layer $max_routing_layer

# set route_guide ${design}_${platform}.route_guide
# global_route -guide_file $route_guide \
#   -congestion_iterations 100 -verbose

# set verilog_file [make_result_file ${design}_${platform}.v]
# write_verilog -remove_cells $filler_cells $verilog_file

################################################################
# Repair antennas post-GRT

# utl::set_metrics_stage "grt__{}"
# repair_antennas -iterations 5

# check_antennas
# utl::clear_metrics_stage
# utl::metric "GRT::ANT::errors" [ant::antenna_violation_count]

################################################################
# Detailed routing

# Run pin access again after inserting diodes and moving cells
# pin_access -bottom_routing_layer $min_routing_layer \
#            -top_routing_layer $max_routing_layer

# detailed_route


# write_guides ${design}_${platform}_output_guide.mod
# set drv_count [detailed_route_num_drvs]
# utl::metric "DRT::drv" $drv_count

# set routed_db ${design}_${platform}_route.db
# write_db $routed_db

# set routed_def ${design}_${platform}_route.def
# write_def $routed_def


# set_routing_layers -signal METAL2-METAL7
# set_wire_rc -signal -layer METAL3
# set_wire_rc -clock  -layer METAL5
# global_route -verbose -allow_congestion
# estimate_parasitics -global_routing

# source /home/zhaoxueyan/code/gpu_gate_sizing/src/sizer_os.tcl
# report_worst_slack
# report_tns 

# s_ram_addr_10_